case/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 3e-6;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 3e-6;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3e-6;
        value           uniform 3e-6;
    }

    top
    {
        type            symmetryPlane;
    }
    
    s0
    {
        type            symmetryPlane;
    }

    s1
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            symmetryPlane;
    }

    hull
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
