case/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldAverage1
{
    type        fieldAverage;
    functionObjectLibs ( "libfieldFunctionObjects.so" );
    outputControl outputTime;
    timeStart       1;

    fields
    (
        p
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }
        U
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }
    );
}


// ************************************************************************* //

